Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE9278/TLE9278.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!--Version of used XSLT processor: 2.0 Altova GmbH http://www.altova.com-->
<!--Version of used XSLT: ISFR2SVD.xslt  V0.10-->
<!--Configuration of XSLT: with bit extraction =Yes;  with bit coding =Yes; decodeThe3knownBitAccessTypes = Yes; 0,r and 1,r bit extraction = No-->
<!--Version of used XSLT for fixing SVD issues: SVD_fixes.xslt  V1.4-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.0" xs:noNamespaceSchemaLocation="c:\fm8_xml\XSLT\RD2ISFR\CMSIS-SVD_Schema_1_0.xsd">
	<vendor>Infineon</vendor>
	<name>TLE9278</name>
	<version>0.1</version>
	<description>TLE9278 Family</description>
	<addressUnitBits>8</addressUnitBits>
	<width>8</width>
	<peripherals>
		<peripheral>
			<name>CTRL</name>
			<description>Control</description>
			<baseAddress>0x0000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x40</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>M_S_CTRL</name>
					<description>Mode- and Supply Control</description>
					<addressOffset>1</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MODE</name>
							<description>SBC Mode Control</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal</name>
									<description>SBC Normal Mode</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sleep</name>
									<description>SBC Sleep Mode</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Stop</name>
									<description>SBC Stop Mode</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Soft_Reset</name>
									<description>SBC Reset: Soft Reset is executed (configuration of RSTN triggering in bit SOFT_RESET_RST)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VEXT_ON</name>
							<description>If PCFG is left open, VEXT Mode Control</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VEXT_off</name>
									<description>VCC3 off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VEXT_enabled</name>
									<description>VCC3 is enabled (as independent voltage regulator)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>					
						<field>
							<name>VIO_OV_RST</name>
							<description>VIO Over Voltage Reset / Fail-Safe enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_SBC_restart</name>
									<description>VIO_ OV is set in case of VIO_OV; no SBC Restart or Fail-Safe is entered for VIO_OV</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>depending_on_configuration</name>
									<description>VIO_ OV is set in case of VIO_OV; depending on the device configuration SBC Restart or SBC Fail-Safe Mode is entered(see );</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VIO_RT</name>
							<description>VIO Reset Threshold Control</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Vrt1</name>
									<description>Vrt1 selected (highest threshold)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Vrt2</name>
									<description>Vrt2 selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Vrt3</name>
									<description>Vrt3 selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Vrt4</name>
									<description>Vrt4 selected</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HW_CTRL_0</name>
					<description>Hardware Control 0</description>
					<addressOffset>2</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>PWM_TLAG</name>
							<description>PWM Lag time</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>100μs</name>
									<description>100μs</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1ms</name>
									<description>1ms</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FO_ON</name>
							<description>Failure Output Activation</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>FO not activated by software, FO can be activated by defined failure (0)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>on</name>
									<description>FO activated by software (1)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWM_BY_WK</name>
							<description>PWM of Buck converter enabled by WK pin</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>PFM</name>
									<description>Buck converter uses PFM in SBC Stop Mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>switched_between_PFM_and_PWM (1)</name>
									<description>Buck converter can be switched between PFM and PWM by the WK pin in SBC Stop Mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWM_AUTO</name>
							<description>Automatic transition PFM-PWM in SBC Stop Mode</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VCC3_as_stanalone_regulator (0)</name>
									<description>Buck converter always uses PFM in SBC Stop Mode (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>in_load_sharing_with_VCC1 (1)</name>
									<description>Buck converter uses automatic transition PFM to PWM in case large current needed in SBC Stop Mode. To come back in PFM, write a SBC Stop Mode command to M_S_CTRL.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOOST_EN</name>
							<description>Boost converter enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Boost_Off</name>
									<description>Boost Off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Boost_enabled</name>
									<description>Boost enabled, automatic switch ON for LOW VS Voltage</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG2</name>
							<description>Configuration Select 2</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>after_2nd</name>
									<description>Fail Output (FO) enabled after 2nd watchdog trigger fail Config 3/4</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>after_1st</name>
									<description>Fail Output (FO) enabled after 1st watchdog trigger fail Config 1/2</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WD_CTRL</name>
					<description>Watchdog Control</description>
					<addressOffset>3</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CHECKSUM</name>
							<description>Watchdog Setting Check Sum Bit</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>Counts as 0 for checksum calculation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>Counts as 1 for checksum calculation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_STM_EN_0</name>
							<description>Watchdog Deactivation during SBC Stop Mode, bit 0</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>active</name>
									<description>Watchdog is active in Stop Mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>deactivated</name>
									<description>Watchdog is deactivated in Stop Mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_WIN</name>
							<description>Watchdog Type Selection</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Time-out</name>
									<description>Watchdog works as a Time-Out watchdog</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Window</name>
									<description>Watchdog works as a Window watchdog</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_EN_WK_BUS</name>
							<description>Watchdog Enable after Bus (CAN) Wake in SBC Stop Mode</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>Watchdog will not start after a CAN wake</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>on</name>
									<description>Watchdog starts with a long open window after CANx Wake</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MAX_3_RST</name>
							<description>Limit number of resets due to a Watchdog failure</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>always_reset</name>
									<description>Always generate a reset in case of WD fail</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>after_3_consecutive_resets (1)</name>
									<description>After 3 consecutive resets due to WD fail, no further reset is generated (only valid in config 1/3)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_TIMER</name>
							<description>Watchdog Timer Period</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10ms</name>
									<description>10ms</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20ms</name>
									<description>20ms</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50ms</name>
									<description>50ms</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>100ms</name>
									<description>100ms</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200ms</name>
									<description>200ms</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>500ms</name>
									<description>500ms</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1s</name>
									<description>1000ms</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved</name>
									<description>reserved</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_CTRL_0</name>
					<description>Bus Control</description>
					<addressOffset>4</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CAN0</name>
							<description>HS-CAN Module Modes</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>off</name>
									<description>CAN OFF</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_capable</name>
									<description>CAN is wake capable (no SWK)</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>receive_only</name>
									<description>CAN Receive Only Mode (no SWK)</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>normal</name>
									<description>CAN Normal Mode (no SWK)</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off</name>
									<description>CAN OFF</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_capable_(SWK)</name>
									<description>CAN is wake capable with SWK</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>receive_only_(SWK)</name>
									<description>CAN Receive Only Mode with SWK</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>normal_(SWK)</name>
									<description>CAN Normal Mode with SWK</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_CTRL_0</name>
					<description>Internal Wake Input Control</description>
					<addressOffset>6</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TIMER_WK_EN</name>
							<description>Wake Source Control (for cyclic wake)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Cyclic wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Cyclic wake enabled as a wake source</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBSENSE_CFG</name>
							<description>Battery Voltage Monitoring Threshold Selection</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VBSENSE0_threshold</name>
									<description>VBSENSE0 threshold selected (highest threshold)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VBSENSE1_threshold</name>
									<description>VBSENSE1 threshold selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VBSENSE2_threshold</name>
									<description>VBSENSE2 threshold selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VBSENSE3_threshold</name>
									<description>VBSENSE3 threshold selected</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_STM_EN_1</name>
							<description>Watchdog Deactivation during Stop Mode, bit 1 ()</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>WD_active_in_stop_mode</name>
									<description>Watchdog is active in Stop Mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off (1)</name>
									<description>Watchdog is deactivated in Stop Mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBSENSE_EN</name>
							<description>Enable the fast battery voltage monitoring</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>fast_VB_disabled</name>
									<description>Fast Vbatt Monitoring disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>fast_VB_disabled</name>
									<description>Fast Vbatt Monitoring enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_CTRL_1</name>
					<description>External Wake Source Control</description>
					<addressOffset>7</addressOffset>
					<size>8</size>
					<fields>						
						<field>
							<name>WK_EN</name>
							<description>WK Wake Source Control</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>WK wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>WK is enabled as a wake source</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_PUPD_CTRL</name>
					<description>Wake Input Level Control</description>
					<addressOffset>8</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>WK_PUPD</name>
							<description>WK Pull-Up / Pull-Down Configuration</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>none</name>
									<description>No pull-up / pull-down selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pull-down</name>
									<description>Pull-down resistor selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>none</name>
									<description>Pull-up resistor selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pull-down</name>
									<description>Automatic switching to pull-up or pull-down</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>	
