Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE9278/TLE9278.svd
				<register>
					<name>BUS_CTRL_2</name>
					<description>Bus Control 0</description>
					<addressOffset>10</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CAN_2_Flash</name>
							<description>CAN2 Flash Mode activation</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Flash Mode disabled: CAN communication up to 5MBaud</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Flash Mode enabled: CAN communication for higher than 5MBaud (higher emission on CAN bus - no slew rate control)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_1_Flash</name>
							<description>CAN1 Flash Mode activation</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Flash Mode disabled: CAN communication up to 5MBaud</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Flash Mode enabled: CAN communication for higher than 5MBaud (higher emission on CAN bus - no slew rate control)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN2</name>
							<description>HS-CAN_2 Module Modes</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>CAN OFF</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_capable (no SWK)</name>
									<description>CAN is wake capable (no SWK)</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>receive_only</name>
									<description>CAN Receive Only Mode (no SWK)</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>normal</name>
									<description>CAN Normal Mode (no SWK)</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off</name>
									<description>CAN OFF</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_capable_(SWK)</name>
									<description>CAN is wake capable with SWK</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>receive_only_(SWK)</name>
									<description>CAN Receive Only Mode with SWK</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>normal_(SWK)</name>
									<description>CAN Normal Mode with SWK</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_CTRL_3</name>
					<description>Bus Control 3</description>
					<addressOffset>11</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CAN_SWK</name>
							<description>Banking Control for CAN Selective Wake Configurations</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CAN0</name>
									<description>CAN0 Module</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN1</name>
									<description>CAN1 Module</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN2</name>
									<description>CAN2 Module</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN3</name>
									<description>CAN3 Module</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_0_Flash</name>
							<description>CAN0 Flash Mode activation</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Flash Mode disabled: CAN communication up to 5MBaud</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Flash Mode enabled: CAN communication for higher than 5MBaud (higher emission on CAN bus - no slew rate control)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_3_Flash</name>
							<description>CAN3 Flash Mode activation</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Flash Mode disabled: CAN communication up to 5MBaud</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Flash Mode enabled: CAN communication for higher than 5MBaud (higher emission on CAN bus - no slew rate control)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN3</name>
							<description>HS-CAN_3 Module Modes</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>CAN OFF</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_capable (no SWK)</name>
									<description>CAN is wake capable (no SWK)</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>receive_only</name>
									<description>CAN Receive Only Mode (no SWK)</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>normal</name>
									<description>CAN Normal Mode (no SWK)</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>off</name>
									<description>CAN OFF</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake_capable_(SWK)</name>
									<description>CAN is wake capable with SWK</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>receive_only_(SWK)</name>
									<description>CAN Receive Only Mode with SWK</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>normal_(SWK)</name>
									<description>CAN Normal Mode with SWK</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>								
				<register>
					<name>TIMER_CTRL_0</name>
					<description>Timer_0 Control and Selection</description>
					<addressOffset>12</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TIMER_0_PER</name>
							<description>Cyclic Wake Period Configuration</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>10ms</name>
									<description>10ms</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>20ms</name>
									<description>20ms</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50ms</name>
									<description>50ms</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>100ms</name>
									<description>100ms</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>200ms</name>
									<description>200ms</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1s</name>
									<description>1s</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2s</name>
									<description>2s</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved</name>
									<description>reserved</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HW_CTRL_1</name>
					<description>Hardware Control 1</description>
					<addressOffset>14</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ADC_SEL</name>
							<description>8 bit ADC input channel selector</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>WK</name>
									<description>WK pin is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VBSENSE</name>
									<description>VBSENSE pin is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SOFT_RESET_RSTN</name>
							<description>Soft Reset Configuration</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>triggered</name>
									<description>RSTN will be triggered (pulled low) during a Software Reset (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>no_triggering</name>
									<description>No RSTN triggering during a Software Reset</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BST_VB_UV_OFF</name>
							<description>Boost switch-off control on VBSENSE low voltage condition</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disable</name>
									<description>Boost automatic switch-off disable</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>Boost automatic switch-off enable</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOOST_V</name>
							<description>BOOST Output voltage configuration</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>6.7V</name>
									<description>6.7V output (default)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8V</name>
									<description>8V output</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>10V</name>
									<description>10V output</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>12V</name>
									<description>12V output</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VEXT_VCFG</name>
							<description>VEXT Output voltage configuration</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>5.0V</name>
									<description>5.0V output</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>3.3V</name>
									<description>3.3V output (default)</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.8V</name>
									<description>1.8V output</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1.2V</name>
									<description>1.2V output</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_STAT_CTRL</name>
					<description>System Status Control</description>
					<addressOffset>30</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SYS_STAT</name>
							<description>System Status Control Byte (bit0=LSB; bit7=MSB) Dedicated byte for system configuration, access only by microcontroller</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CTRL</name>
					<description>CAN Selective Wake Control</description>
					<addressOffset>32</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>OSC_CAL</name>
							<description>Oscillator Calibration Mode</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Oscillator Calibration is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Oscillator Calibration is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TRIM_EN</name>
							<description>(Un)locking mechanism of oscillator recalibration</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>locked_0</name>
									<description>locked</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>locked_1</name>
									<description>locked</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>locked_2</name>
									<description>locked</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>unlocked</name>
									<description>unlocked</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CANTO_MASK</name>
							<description>CAN Time Out Masking</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_INTN</name>
									<description>CAN time-out is masked - no interrupt (on pin INTN) is triggered</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTN</name>
									<description>CAN time-out is signaled on INTN</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG_VAL</name>
							<description>SWK Configuration valid</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_valid</name>
									<description>Configuration is not valid (SWK not possible)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>valid</name>
									<description>SWK configuration valid, needs to be set to enable SWK</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_BTL1_CTRL</name>
					<description>SWK Bit Timing Logic Control1</description>
					<addressOffset>33</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TBIT</name>
							<description>Number of Time Quanta in a Bit Time</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_BTL2_CTRL</name>
					<description>SWK Bit Timing Control2</description>
					<addressOffset>34</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SP</name>
							<description>Sampling Point Position</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ID3_CTRL</name>
					<description>SWK WUF Identifier bits 28...21</description>
					<addressOffset>35</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ID28_21</name>
							<description>WUF Identifier Bits 28...21</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ID2_CTRL</name>
					<description>SWK WUF Identifier bits 20...13</description>
					<addressOffset>36</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ID20_13</name>
							<description>WUF Identifier Bits 20...13</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ID1_CTRL</name>
					<description>SWK WUF Identifier bits 12...5</description>
					<addressOffset>37</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ID12_5</name>
							<description>WUF Identifier Bits 12...5</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ID0_CTRL</name>
					<description>SWK WUF Identifier bits 4...0</description>
					<addressOffset>38</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ID4_0</name>
							<description>WUF Identifier Bits 4..0</description>
							<lsb>2</lsb>
							<msb>6</msb>
							<access>read-write</access>							
							<enumeratedValues>
							</enumeratedValues>
						</field>
						<field>
							<name>RTR</name>
							<description>Remote Transmission Request Field (acc. ISO 11898-1)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>disabled</name>
									<description>Normal Data Frame</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Remote Transmission Request</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDE</name>
							<description>Identifier Extension Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>11bit</name>
									<description>Standard Identifier Length (11 bit)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>29bit</name>
									<description>Extended Identifier Length (29 bit)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_MASK_ID3_CTRL</name>
					<description>SWK WUF Identifier Mask bits 28...21</description>
					<addressOffset>39</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MASK_ID28_21</name>
							<description>WUF Identifier Mask Bits 28...21</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ignored</name>
									<description>Unmasked - bit is ignored</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Masked - bit is compared in CAN frame</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_MASK_ID2_CTRL</name>
					<description>SWK WUF Identifier Mask bits 20...13</description>
					<addressOffset>40</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MASK_ID20_13</name>
							<description>WUF Identifier Mask Bits 20...13</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ignored (0)</name>
									<description>Unmasked - bit is ignored</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled (1)</name>
									<description>Masked - bit is compared in CAN frame</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_MASK_ID1_CTRL</name>
					<description>SWK WUF Identifier Mask bits 12...5</description>
					<addressOffset>41</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>MASK_ID12_5</name>
							<description>WUF Identifier Mask Bits 12...5</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ignored</name>
									<description>Unmasked - bit is ignored</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enabled</name>
									<description>Masked - bit is compared in CAN frame</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
