Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE9278/TLE9278.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>STAT</name>
			<description>Status</description>
			<baseAddress>0b1000000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x40</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SUP_STAT_1</name>
					<description>Supply Voltage Fail Status</description>
					<addressOffset>0</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>VB_UV_BST</name>
							<description>VBSENSE low voltage detection</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VBSENSE low voltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VBSENSE low voltage detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV</name>
							<description>VS Under-Voltage Detection (VS,UV)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VS undervoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VS undervoltage detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VEXT_OC</name>
							<description>VEXT Over Current Detection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No OC</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>OC detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREG_UV</name>
							<description>VEXT Over Current Detection</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VEXT UV detection (PCFG OPEN); No VCC1 UV detection (PCFG connected to GND)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VEXT UV Fail detected (PCFG OPEN); VCC1 UV Fail detected  (PCFG connected to GND)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VEXT_OT</name>
							<description>VEXT Over Temperature Detection</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No over temperature</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VEXT over temperature detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VIO_OV</name>
							<description>VIO Over Voltage Detection (VIO,OV,r)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VIO overvoltage warning</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VIO overvoltage detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VIO_WARN</name>
							<description>VIO Undervoltage Prewarning (VPW,f)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VIO undervoltage prewarning</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VIO undervoltage prewarning detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SUP_STAT_0</name>
					<description>Supply Voltage Fail Status</description>
					<addressOffset>1</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>POR</name>
							<description>Power-On Reset Detection</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No POR</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>POR occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VIO_SC</name>
							<description>VIO Short to GND Detection</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No short</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC1 short to GND detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VIO_UV_FS</name>
							<description>VIO UV-Detection (due to VRTx reset)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Fail-Safe Mode entry due to 4th consecutive VIO_UV</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Fail-Safe Mode entry due to 4th consecutive VIO_UV</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>						
						<field>
							<name>VIO_UV</name>
							<description>VIO UV-Detection (due to VRTx reset)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VIO_UV detection</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VIO UV-Fail detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>THERM_STAT</name>
					<description>Thermal Protection Status</description>
					<addressOffset>2</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>VCC1_OT</name>
							<description>VCC1 Over temperature detection</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VCC1 overtemperature</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VCC1 overtemperature detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BOOST_OT</name>
							<description>Boost Over temperature detection</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Boost overtemperature</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Boost overtemperature detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSD2</name>
							<description>TSD2 Thermal Shut-Down Detection</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No TSD2 event</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>TSD2 OT detected - leading to SBC Fail-Safe Mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TSD1</name>
							<description>TSD1 Thermal Shut-Down Detection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No TSD1 fail</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>TSD1 OT detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TPW</name>
							<description>Thermal Pre Warning</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Thermal Pre warning</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Thermal Pre warning detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DEV_STAT</name>
					<description>Device Information Status</description>
					<addressOffset>3</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>DEV_STAT</name>
							<description>Device Status before Restart Mode</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>cleared</name>
									<description>Cleared (Register must be actively cleared)</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>failure</name>
									<description>Restart due to failure described in Table 8 and Table 9 </description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sleep_Mode</name>
									<description>Sleep Mode</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved</name>
									<description>Reserved</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WD_FAIL</name>
							<description>Number of WD-Failure Events (1/2 WD failures depending on INTN)</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No WD Fail</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1</name>
									<description>1x WD Fail, FO activation - Config 1/2 selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>2x WD Fail, FO activation - Config  3/4 selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved</name>
									<description>Reserved (never reached)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI_FAIL</name>
							<description>SPI Fail Information</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No SPI fail</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Invalid SPI command detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FO_ON_STATE</name>
							<description>Activation of Fail Output FO</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Failure</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Failure occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_STAT_0</name>
					<description>Bus Communication Status</description>
					<addressOffset>4</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CANTO</name>
							<description>CAN_0 Time Out Detection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>Normal operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>CAN Time Out detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSERR_0</name>
							<description>SWK System Error</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>Selective Wake Mode is possible</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>System Error detected, SWK enabling not possible</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_0_FAIL</name>
							<description>CAN Failure Status</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>none</name>
									<description>No error</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TSD_shutdown</name>
									<description>CAN TSD shutdown</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TXD_DOM</name>
									<description>CAN_TXD_DOM: TXD dominant time out for more than 2ms</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BUS_DOM</name>
									<description>CAN_BUS_DOM: BUS dominant time out for more than 2ms</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCAN_UV</name>
							<description>Under voltage CAN Bus Supply</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>detected</name>
									<description>Normal operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>not_detected</name>
									<description>CAN Supply undervoltage detected. Transmitter disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_STAT_0</name>
					<description>Wake-up Source and Information Status 0</description>
					<addressOffset>6</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>PFM_PWM</name>
							<description>PFM_PWM automatic transition detected</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No automatic PFM_PWM transition detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Automatic PFM_PWM transition detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_0_WU</name>
							<description>Wake up via CAN Bus</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIMER_0_WU</name>
							<description>Wake up via cyclic wake</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK_WU</name>
							<description>Wake up via WK</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
