Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE9278/TLE9278.svd
				<register>
					<name>WK_LVL_STAT</name>
					<description>WK Input Level</description>
					<addressOffset>8</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>TEST</name>
							<description>Status of TEST Pin</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>User-Mode</name>
									<description>Default SBC user mode operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Development-Mode</name>
									<description>Software Development Mode, no reset triggered due to wrong Watchdog trigger</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG1_STATE</name>
							<description>Status of INTN Pin</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>low_level</name>
									<description>LOW Level; Fail-Safe Mode entered due to WD failure (1 or 2 failure) depending on CFG2 bit) Config 2/4</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>high_level</name>
									<description>HIGH Level; Fail-Safe Mode not entered, due to WD failure, Config 1/3</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CFG2_STATE</name>
							<description>Status of CFG2 bit on HW_CTRL_0 register</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>low_level</name>
									<description>LOW Level (=0), Fail Outputs (FOx) are active after 2nd watchdog trigger fail Config 3/4</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>high_level</name>
									<description>HIGH Level (=1); Fail Outputs (FOx) are active after 1st watchdog trigger fail Config 1/2</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCFG_STATE</name>
							<description>Status of PCFG Pin</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>low_level</name>
									<description>LOW Level; the VEXT is fix at 3.3V and it has to be connected to VIO to supply the microcontroller (connected to GND)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>high_level</name>
									<description>HIGH Level; the microcontroller is supplied from the VCC1 and VIO=VCC1. The VEXT is fully configurable (left OPEN)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBAT_UV_STATE</name>
							<description>VBSENSE Under-Voltage Detection Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No VBSENSE undervoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VBSENSE undervoltage detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WK</name>
							<description>Status of WK</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>low_level</name>
									<description>Low Level (=0)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>high_level</name>
									<description>High Level (=1)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WK_STAT_2</name>
					<description>Wake-up Source and Information Status 2</description>
					<addressOffset>9</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>VBAT_UV_LATCH</name>
							<description>VBSENSE Under-Voltage Detection</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not-detected</name>
									<description>No VBSENSE undervoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>VBSENSE undervoltage detected (latched status)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_3_WU</name>
							<description>Wake up via CAN_3 Bus</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_wake_up</name>
									<description>No wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_2_WU</name>
							<description>Wake up via CAN_2 Bus</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_wake_up</name>
									<description>No wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_1_WU</name>
							<description>Wake up via CAN_1 Bus</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_wake_up</name>
									<description>No wake up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up</name>
									<description>Wake up</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_STAT_2</name>
					<description>Bus Communication Status 2</description>
					<addressOffset>10</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CANTO_2</name>
							<description>CAN_2 Time Out Detection</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>Normal operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>CAN Time Out detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSERR_2</name>
							<description>CAN_2 SWK System Error</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>Selective Wake Mode is possible</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>System Error detected, SWK enabling not possible</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_2_FAIL</name>
							<description>CAN_2 Failure Status</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No error</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN_TSD</name>
									<description>CAN TSD shutdown</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN_TXD_DOM(10)</name>
									<description>CAN_TXD_DOM: TXD dominant time out for more than 2ms</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN_BUS_DOM (11)</name>
									<description>CAN_BUS_DOM: BUS dominant time out for more than 2ms</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CANTO_1</name>
							<description>CAN_1 Time Out Detection</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>Normal operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>CAN Time Out detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSERR_1</name>
							<description>CAN_1 SWK System Error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>Selective Wake Mode is possible</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>System Error detected, SWK enabling not possible</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_1_FAIL</name>
							<description>CAN_1 Failure Status</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No error</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN TSD shutdown</name>
									<description>Wake up</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN_TXD_DOM</name>
									<description>CAN_TXD_DOM: TXD dominant time out for more than 2ms</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN_BUS_DOM</name>
									<description>CAN_BUS_DOM: BUS dominant time out for more than 2ms</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BUS_STAT_3</name>
					<description>Bus Communication Status 3</description>
					<addressOffset>11</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>CANTO_3</name>
							<description>CAN_3 Time Out Detection</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>Normal operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>CAN Time Out detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYSERR_3</name>
							<description>CAN_3 SWK System Error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>Selective Wake Mode is possible</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>System Error detected, SWK enabling not possible</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CAN_3_FAIL</name>
							<description>CAN_3 Failure Status</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No error</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN TSD shutdown</name>
									<description>Wake up</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN_TXD_DOM</name>
									<description>CAN_TXD_DOM: TXD dominant time out for more than 2ms</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CAN_BUS_DOM</name>
									<description>CAN_BUS_DOM: BUS dominant time out for more than 2ms</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SMPS_STAT</name>
					<description>Bus Communication Status 3</description>
					<addressOffset>12</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>BST_ACT</name>
							<description>Boost Regulator Active</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_active</name>
									<description>Boost not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>Boost active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BST_SH</name>
							<description>BSTD short detection</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No short detected on BSTD pin</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>BSTD short to GND</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BST_OP</name>
							<description>BSTD open detection</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No open detected on BSTD pin</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>BSTD loss of diode detected or loss of Boost GND</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BCK_SH</name>
							<description>BCKSW pin short detection</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No BCKSW short detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>SShort to GND or short to VS detected on BCKSW pin</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BCK_OP</name>
							<description>BCKSW pin open detection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No BCKSW open detected</name>
									<description>not-detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>BCKSW open detected</name>
									<description>detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>				
				<register>
					<name>SWK_STAT_3</name>
					<description>Selective Wake Status CAN_3</description>
					<addressOffset>36</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SYNC_3</name>
							<description>CAN_3 Synchronisation (at least one CAN frame without fail must have been received)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>failed</name>
									<description>SWK function not working or not synchronous to CAN bus</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>valid</name>
									<description>Valid CAN frame received, SWK function is synchronous to CAN_3 bus</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CANSIL_3</name>
							<description>CAN_3 Silent Time during SWK operation</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_exceeded</name>
									<description>tsilence not exceeded</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>exceeded</name>
									<description>set if tsilence is exceeded</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SWK_SET_3</name>
							<description>CAN_3 Selective Wake Activity</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_activated</name>
									<description>Selective Wake is not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>activated</name>
									<description>Selective Wake is activated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUP_3</name>
							<description>CAN_3 Wake-up Pattern Detection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No WUP</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>WUP detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WUF_3</name>
							<description>CAN_3 SWK Wake-up Frame Detection (acc. ISO 11898-6)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No WUF</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>WUF detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ECNT_STAT_3</name>
					<description>SWK Error Counter Status CAN_3</description>
					<addressOffset>37</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ECNT_3</name>
							<description>SWK CAN_3 Frame Error Counter</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>0</name>
									<description>No Frame Error</description>
									<value>0b000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>31</name>
									<description>31 Frame Errors have been counted</description>
									<value>0b011111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>overflow</name>
									<description>Error counter overflow - SWK function will be disabled</description>
									<value>0b100000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CDR_STAT_3_1</name>
					<description>CDR Status CAN_3_1</description>
					<addressOffset>38</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>NAVG_SAT_3</name>
							<description>Output Value from Filter Block</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CDR_STAT_3_0</name>
					<description>CDR Status CAN_3_0</description>
					<addressOffset>39</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>NAVG_SAT_3</name>
							<description>Output Value from Filter Block</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>							
							</enumeratedValues>
						</field>
					</fields>
				</register>
