Infineon/SBC-for-Arduino/LiteSBC Microcontroller Library/com.ifx.tb.legacy.configwizard_2.1.30.201902131318/application/scripts/ICW_TLE9278/TLE9278.svd
				<register>
					<name>SWK_STAT_2</name>
					<description>Selective Wake Status CAN_2</description>
					<addressOffset>40</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SYNC_2</name>
							<description>CAN_2 Synchronisation (at least one CAN frame without fail must have been received)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_synchronous</name>
									<description>SWK function not working or not synchronous to CAN bus</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>synchronous</name>
									<description>Valid CAN frame received, SWK function is synchronous to CAN_2 bus</description>
									<value>0b1</value>
								</enumeratedValue>									
							</enumeratedValues>
						</field>
						<field>
							<name>CANSIL_2</name>
							<description>CAN_2 Silent Time during SWK operation</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_exceeded</name>
									<description>tsilence not exceeded</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>exceeded</name>
									<description>set if tsilence is exceeded</description>
									<value>0b1</value>
								</enumeratedValue>									
							</enumeratedValues>
						</field>
						<field>
							<name>SWK_SET_2</name>
							<description>CAN_2 Selective Wake Activity</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_active</name>
									<description>Selective Wake is not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>active</name>
									<description>Selective Wake is activated</description>
									<value>0b1</value>
								</enumeratedValue>									
							</enumeratedValues>
						</field>
						<field>
							<name>WUP_2</name>
							<description>CAN_2 Wake-up Pattern Detection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No WUP</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>WUP detected</description>
									<value>0b1</value>
								</enumeratedValue>									
							</enumeratedValues>
						</field>
						<field>
							<name>WUF_2</name>
							<description>CAN_2 SWK Wake-up Frame Detection (acc. ISO 11898-6)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No WUF</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>WUF detected</description>
									<value>0b1</value>
								</enumeratedValue>									
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ECNT_STAT_2</name>
					<description>SWK Error Counter Status CAN_2</description>
					<addressOffset>41</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ECNT_2</name>
							<description>SWK CAN_2 Frame Error Counter</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Frame Error</description>
									<value>0b000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>31_errors</name>
									<description>31 Frame Errors have been counted</description>
									<value>0b011111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>overflow</name>
									<description>Error counter overflow - SWK function will be disabled</description>
									<value>0b100000</value>
								</enumeratedValue>									
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CDR_STAT_2_1</name>
					<description>CDR Status CAN_2_1</description>
					<addressOffset>42</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>NAVG_SAT_2</name>
							<description>Output Value from Filter Block</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>								
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CDR_STAT_2_0</name>
					<description>CDR Status CAN_2_0</description>
					<addressOffset>43</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>NAVG_SAT_2</name>
							<description>Output Value from Filter Block</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>								
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_STAT_1</name>
					<description>Selective Wake Status CAN_1</description>
					<addressOffset>44</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SYNC_1</name>
							<description>CAN_1 Synchronisation (at least one CAN frame without fail must have been received)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_synchronous</name>
									<description>SWK function not working or not synchronous to CAN bus</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>synchronous</name>
									<description>Valid CAN frame received, SWK function is synchronous to CAN_1 bus</description>
									<value>0b1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
						<field>
							<name>CANSIL_1</name>
							<description>CAN_1 Silent Time during SWK operation</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_exceeded</name>
									<description>tsilence not exceeded</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>exceeded</name>
									<description>set if tsilence is exceeded</description>
									<value>0b1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
						<field>
							<name>SWK_SET_1</name>
							<description>CAN_1 Selective Wake Activity</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_actived</name>
									<description>Selective Wake is not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>actived</name>
									<description>Selective Wake is activated</description>
									<value>0b1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
						<field>
							<name>WUP_1</name>
							<description>CAN_1 Wake-up Pattern Detection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No WUP</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>WUP detected</description>
									<value>0b1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
						<field>
							<name>WUF_1</name>
							<description>CAN_1 SWK Wake-up Frame Detection (acc. ISO 11898-6)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No WUF</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>WUF detected</description>
									<value>0b1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ECNT_STAT_1</name>
					<description>SWK Error Counter Status CAN_1</description>
					<addressOffset>45</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ECNT_1</name>
							<description>SWK CAN_1 Frame Error Counter</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Frame Error</description>
									<value>0b000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>31_errors</name>
									<description>31 Frame Errors have been counted</description>
									<value>0b011111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>overflow</name>
									<description>Error counter overflow - SWK function will be disabled</description>
									<value>0b100000</value>
								</enumeratedValue>									
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CDR_STAT_1_1</name>
					<description>SWK Error Counter Status CAN_1</description>
					<addressOffset>46</addressOffset>
					<size>8</size>
					<fields>
						<field>
						<name>NAVG_SAT_1</name>
							<description>Output Value from Filter Block</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>									
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CDR_STAT_1_0</name>
					<description>CDR Status CAN_1_0</description>
					<addressOffset>47</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>NAVG_SAT_1</name>
							<description>Output Value from Filter Block</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>									
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_STAT_0</name>
					<description>Selective Wake Status CAN_0</description>
					<addressOffset>48</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>SYNC_0</name>
							<description>CAN_0 Synchronisation (at least one CAN frame without fail must have been received)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_synchronous</name>
									<description>SWK function not working or not synchronous to CAN bus</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>synchronous</name>
									<description>Valid CAN frame received, SWK function is synchronous to CAN_0 bus</description>
									<value>0b1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
						<field>
							<name>CANSIL_0</name>
							<description>CAN_0 Silent Time during SWK operation</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_exceeded</name>
									<description>tsilence not exceeded</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>exceeded</name>
									<description>set if tsilence is exceeded</description>
									<value>0b1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
						<field>
							<name>SWK_SET_0</name>
							<description>CAN_0 Selective Wake Activity</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_actived</name>
									<description>Selective Wake is not active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>actived</name>
									<description>Selective Wake is activated</description>
									<value>0b1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
						<field>
							<name>WUP_0</name>
							<description>CAN_0 Wake-up Pattern Detection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No WUP</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>WUP detected</description>
									<value>0b1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
						<field>
							<name>WUF_0</name>
							<description>CAN_0 SWK Wake-up Frame Detection (acc. ISO 11898-6)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No WUF</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>detected</name>
									<description>WUF detected</description>
									<value>0b1</value>
								</enumeratedValue>								
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_ECNT_STAT_0</name>
					<description>SWK Error Counter Status CAN_0</description>
					<addressOffset>49</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ECNT_0</name>
							<description>SWK CAN_0 Frame Error Counter</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_detected</name>
									<description>No Frame Error</description>
									<value>0b000000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>31_errors</name>
									<description>31 Frame Errors have been counted</description>
									<value>0b011111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>overflow</name>
									<description>Error counter overflow - SWK function will be disabled</description>
									<value>0b100000</value>
								</enumeratedValue>									
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CDR_STAT_0_1</name>
					<description>CDR Status CAN_0_1</description>
					<addressOffset>50</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>NAVG_SAT_0</name>
							<description>Output Value from Filter Block</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>	
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SWK_CDR_STAT_0_0</name>
					<description>CDR Status CAN_0_0</description>
					<addressOffset>51</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>NAVG_SAT_0</name>
							<description>Output Value from Filter Block</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>	
							</enumeratedValues>
						</field>
					</fields>
				</register>						
				<register>
					<name>FAM_PROD_STAT</name>
					<description>Family and Product Identification Register</description>
					<addressOffset>62</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>FAM</name>
							<description>SBC Family Identifier (bit4=LSB; bit7=MSB)</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>HERA</name>
									<description>Driver SBC Family (HERA)</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HERCULES</name>
									<description>DC/DC-SBC Family (HERCULES)</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ATHENA</name>
									<description>Mid-Range SBC Family (ATHENA)</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>MCP</name>
									<description>Multi-CAN SBC Family (MCP)</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LITE</name>
									<description>LITE SBC Family (LITE)</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ATHENA+</name>
									<description>Mid-Range+ SBC Family (ATHENA+)</description>
									<value>0b0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROD</name>
							<description>SBC Product Identifier (bit0=LSB; bit3=MSB)</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>reserved_0</name>
									<description>reserved</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved_1</name>
									<description>reserved</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9461ES</name>
									<description>TLE9461ES (VCC1 = 5V, no SWK)</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9461ESV33</name>
									<description>TLE9461ESV33 (VCC1 = 3.3V, no SWK)</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9461-3ES</name>
									<description>TLE9461-3ES (VCC1 = 5V, SWK) (default value if device is not fused)</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9461-3ESV33</name>
									<description>TLE9461-3ESV33 (VCC1 = 3.3V, SWK)</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved_8</name>
									<description>reserved</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reserved_9</name>
									<description>reserved</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9471ES</name>
									<description>TLE9471ES (VCC1 = 5V, no SWK)</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9471ESV33</name>
									<description>TLE9471ESV33 (VCC1 = 3.3V, no SWK)</description>
									<value>0b1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9471-3ES</name>
									<description>TLE9471-3ES(VCC1 = 5V, SWK)</description>
									<value>0b1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TLE9471-3ESV33</name>
									<description>TLE9471-3ESV33 (VCC1 = 3.3V, SWK)</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>